### Series 변환

In [3]:
import pandas as pd

data = {'Region' : ['Korea', 'America', 'Chaina', 'Canada', 'Italy'],
        'Sales' : [300, 200, 500, 150, 50],
        'Amount' : [90, 80, 100, 30, 10],
        'Employee' : [20, 10, 30, 5, 3]
        }
s = pd.Series(data)
s

Region      [Korea, America, Chaina, Canada, Italy]
Sales                      [300, 200, 500, 150, 50]
Amount                        [90, 80, 100, 30, 10]
Employee                         [20, 10, 30, 5, 3]
dtype: object

### DataFrame 변환
- 인덱스 칼럼 외에도 여러 개의 칼럼 가질 수 있음

In [4]:
s = pd.DataFrame(data)
s

    Region  Sales  Amount  Employee
0    Korea    300      90        20
1  America    200      80        10
2   Chaina    500     100        30
3   Canada    150      30         5
4    Italy     50      10         3

In [5]:
s.columns

Index(['Region', 'Sales', 'Amount', 'Employee'], dtype='object')

In [6]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
s.index=['one','two','three','four','five']
s.columns = ['a','b','c','d']
s

             a    b    c   d
one      Korea  300   90  20
two    America  200   80  10
three   Chaina  500  100  30
four    Canada  150   30   5
five     Italy   50   10   3